[
  {
    "merchandise": "amazon",
    "country": "ca",
    "id": "22584d27-342e-4658-8024-08c39e456707",
    "asin": "B0CXPR5412",
    "title": "Nothing Ear(a) Wireless Earbuds with Active Noise Cancellation, Bass Boost Algorithm and Up to 42.5 Hours of Listening Time - Black",
    "price": "99.99",
    "main_image_url": "https://m.media-amazon.com/images/I/51VDYCFi-KL._AC_SY700_.jpg",
    "page_url": "https://www.amazon.ca/dp/B0CXPR5412",
    "description": [
      "Powerful 11mm Driver: We've made our driver even more compact. With dual power than Ear (2), Ear (a) delivers even deeper bass performance. The extra space gives sound waves more space to vibrate. With two new valves, the airflow inside the knob improves For less distortion and richer overall clarity",
      "Smart Active Noise Cancellation: Up to 45 dB, no ear (a) automatically checks for noise leakage between the earbud and ear canal, and then apply more noise reduction to make up. So you get the best possible noise reduction. Happens every time you put them in. So you can walk from quiet rooms to busy streets without hearing anything (other than what is played)",
      "Clear voice technology: Clear like day. Ear (a) isolates your voice from everyday distractions so that on-the-go calls feel like face-to-face conversations. With a new talc microphone and extra airway on the stem for the wind to pass through, we have reduced interference by 60% compared to ear (2)",
      "Long playtime, quick charge: For quick power ups, the ear (a) can be fast charged for 10 minutes and deliver 10 hours of music playback (with ANC switched off). Compared to ears (2), ears(a) can provide 40.5% more continuous playtime on a single charge. Or put the earbuds back into the case and stretch your listening time to over 42.5 hours (with ANC switched off), Playback with ANC on: Up to 24.5 hours with case and 5.5 hours with just knobs, ANC off talk time: Up to 23 hours with case and 5.2 hours with knobs only",
      "More performance: Low team mode, reduced sound delay for better gaming. Automatically triggered in game mode on a no-phone With end-to-end latency of less than 120 meters. Stay connected to two devices at the same time. Play music on your laptop then switch seamlessly to answer a call on your phone. Simple. Adaptive ANC, next level escapism. Switch between 3 levels of noise reduction. Or let your ear (a) take control. By selecting \"Adaptive\" in the Nothing X app, Ear (a) automatically applies the right level of noise cancellation depending on your surroundings in real time",
      "ChatGPT, integrated: Ask , listen and learn from ChatGPT on the go. A first-class integration, made for your nothing ecosystem. Use your voice to access the ChatGPT on-ear and ear (a), wherever you are. Configure via the Nothing X app. Get the answers you need faster and close at hand. Text, voice or image search directly from the home screen (only on nothing earbuds when connected to nothing phones.)"
    ],
    "rating": "4.3",
    "scraped_at": "2025-07-17 22:18:22",
    "review_count": 3020
  },
  {
    "merchandise": "amazon",
    "country": "ca",
    "id": "8a29164c-87d8-4979-a9dc-cab05f547b9f",
    "asin": "B09VJJLFX9",
    "title": "Audio-Technica ATH-M20xBT Wireless Over-Ear Headphones, Black",
    "price": "119.99",
    "main_image_url": "https://m.media-amazon.com/images/I/8123MFd26NL._AC_SY550_.jpg",
    "page_url": "https://www.amazon.ca/dp/B09VJJLFX9",
    "description": [
      "Wireless, on-the-go design delivers the same sonic signature as the wired ATH-M20x professional studio headphones",
      "40 mm drivers with rare earth magnets and copper-clad aluminum wire voice coils are tuned for enhanced low-frequency performance",
      "Low latency mode improves synchronicity between audio and video for smooth streaming and gaming",
      "Multipoint pairing function allows you to stay connected to two Bluetooth devices at once",
      "Up to 60 hours of continuous use on a full charge and up to 3 hours of use on a 10-minute rapid charge (via USB-C connection). Sensitivity 100 dB/mW"
    ],
    "rating": "4.4",
    "scraped_at": "2025-07-17 22:18:34",
    "review_count": 1561
  },
  {
    "merchandise": "amazon",
    "country": "ca",
    "id": "2608127f-a842-4558-bef5-7ac456e21131",
    "asin": "B0BGRJNV9C",
    "title": "LK [6 Pack] for Apple Watch Ultra/Ultra 2 49mm Screen Protector, Shockproof 9H Tempered Glass, [Scratch-Resistant] [Bubble-Free] [Touch Sensitive], HD Ultra-Thin Screen Protector for iWatch Ultra/Ultra 2 49mm",
    "price": "16.99",
    "main_image_url": "https://m.media-amazon.com/images/I/713dHmtXgYL._AC_SX425_.jpg",
    "page_url": "https://www.amazon.ca/dp/B0BGRJNV9C",
    "description": [
      "🎅[Compatible For Apple Watch Ultra 49mm]: 🎄LK Apple Watch Ultra Screen Protector 49mm is compatible for iWatch Ultra 49mm. Note: Please check your Apple Watch's model & size before ordering.",
      "🎅[Premium Screen Protector]: 9H Tempered glass screen protector, LK Apple Watch Ultra Screen Protector provides all-around protection. 🎁The crystal-clear screen protector features scratch-resistant, water-resistant, touch-sensitive, and bubble-free.",
      "🎅[Ultra-Thin & High Touch-Sensitivity]: With the ultra-thin design & 99% transmittance features, ⛄️LK Apple Watch Ultra tempered glass screen protector is crystal-clear, which enables you to feel the original sense of touch & keep the high resolution of images, which providing you with a perfect touch experience.",
      "🎅[Bubble-Free Installation]: Our customized installation kits will help you install the screen protector quickly and correctly, which can reduce bubbles and errors.Please watch our video before installing it.🍎",
      "🎅[LK Service]: LK is committed to providing customers with best products and professional service. If you have any questions or issues about the screen protective case, just feel freely contact us. 💝We will be always here to help you and resolve it for you within 24 hours."
    ],
    "rating": "4.2",
    "scraped_at": "2025-07-17 22:18:46",
    "review_count": 74316
  },
  {
    "merchandise": "amazon",
    "country": "ca",
    "id": "200043a2-cce5-4884-acaf-0f69b50dcb00",
    "asin": "B0DGJKT2X9",
    "title": "Apple AirPods Max Wireless Over-Ear Headphones, Pro-Level Active Noise Cancellation, Transparency Mode, Personalized Spatial Audio, USB-C Charging, Bluetooth Headphones for iPhone – Starlight",
    "price": "779.00",
    "main_image_url": "https://m.media-amazon.com/images/I/411M-s-oIFL._AC_SX425_.jpg",
    "page_url": "https://www.amazon.ca/dp/B0DGJKT2X9",
    "description": [
      "ULTIMATE OVER-EAR LISTENING EXPERIENCE—Apple-designed dynamic driver provides high-fidelity audio. Computational audio combines custom acoustic design with the Apple H1 chip and software for breakthrough listening experiences like Lossless Audio with ultra-low latency over USB-C.*",
      "FIVE FRESH COLOURS—AirPods Max come in five fresh colours: Midnight, Starlight, Blue, Purple and Orange. A colour-matched Smart Case is also included.",
      "FOCUS ON WHAT’S PLAYING—Pro-level Active Noise Cancellation removes up to 2x more background noise, so you can immerse yourself in music.",
      "HEAR THE WORLD AROUND YOU—Transparency mode lets you comfortably hear and interact with the world around you.",
      "PERSONALIZED SPATIAL AUDIO—With sound that suits your unique ear shape along with dynamic head tracking, AirPods Max deliver an immersive listening experience that places sound all around you. You can also listen to select songs, shows and movies in Dolby Atmos.",
      "ACOUSTIC-FIRST DESIGN — Designed with a knit-mesh canopy and memory foam ear cushions for an exceptional over-ear fit that perfectly seals in sound.",
      "MAGICAL EXPERIENCE — Pair AirPods Max by simply placing them near your device and tapping Connect on your screen. AirPods Max pause audio when you take them off. And Automatic Switching makes listening between your iPhone, iPad and Mac completely effortless."
    ],
    "rating": "4.6",
    "scraped_at": "2025-07-17 22:18:59",
    "review_count": 390
  },
  {
    "merchandise": "amazon",
    "country": "ca",
    "id": "add15a31-f500-47d9-9b49-0ba0da04c4b9",
    "asin": "B0CW1KVSVF",
    "title": "Fujifilm X100VI Digital Camera - Black",
    "price": "998.00",
    "main_image_url": "https://m.media-amazon.com/images/I/71olA3UfFXL.__AC_SY700_SX700_QL70_ML2_.jpg",
    "page_url": "https://www.amazon.ca/dp/B0CW1KVSVF",
    "description": [
      "Higher Resolution, Higher Freedom: Make unforgettable content with the portable and lightweight FUJIFILM X100VI digital camera. Fusing a classic, tactile dial-based design with Fujifilm’s most advanced digital imaging technology, delivering 1.5x more resolution than the predecessor X100V model, at almost twice the speed. Take control over exposure with the internal 4-stop ND, move closer to the action with 1.4x and 2x digital teleconverters.",
      "Fast AF, any Questions?: Be ready for every creative moment with X100VI’s state-of-the-art autofocus (AF) system. By harnessing the power of its new X-Processor 5 image processing engine, the camera uses a state-of-the-art AF algorithm and deep-learning AI technology to broaden the range of subjects it can recognize. This enables X100VI to accurately track objects, even in low-light conditions when unpredictability can be the difference between getting the image, or missing it.",
      "Keep Your Creativity Moving: When the light is low and the stakes are high, X100VI ensures photos stay sharp and videos stable thanks to the up to 6 stop in-body image stabilization (IBIS) system. Internal gyro sensors minimize the impact of camera shake for those critical moments by detecting movements and vibrations across five axes.",
      "Cloud Collaboration Made Easy: Create, share and collaborate in an instant with X100VI’s native Frame.io Camera to Cloud technology. Wirelessly connect to an active internet connection, authenticate to Frame.io, and start uploading photos and videos at the moment of creation.",
      "Professional Reels in the Palm of Your Hand: Stay versatile! In addition to 40MP stills, X100VI delivers professional quality video straight out of camera in resolutions up to 6.2K/30P and 4K/60P. On-the-go content creators can also use one of Fujifilm’s 20 built-in unique Film Simulation modes, including the new REALA ACE, and take control with two F-Log options to maximize flexibility in post-production workflows."
    ],
    "rating": "4.5",
    "scraped_at": "2025-07-17 22:19:11",
    "review_count": 129
  },
  {
    "merchandise": "amazon",
    "country": "ca",
    "id": "0c931692-741d-4f52-98e7-c30f09fb57d3",
    "asin": "B0CHWRXH8B",
    "title": "Apple AirPods Pro 2 Wireless Earbuds, Bluetooth Headphones, Active Noise Cancellation, Transparency, Personalized Spatial Audio, High-Fidelity Sound, H2 Chip, USB-C Charging",
    "price": "246.69",
    "main_image_url": "https://m.media-amazon.com/images/I/51NRGHU2NoL._AC_SX425_.jpg",
    "page_url": "https://www.amazon.ca/dp/B0CHWRXH8B",
    "description": [
      "ADVANCED HEARING HEALTH FEATURES — Hearing Protection works across listening modes and features like pro-level Active Noise Cancellation, Conversation Awareness and more to help protect your hearing for daily life.",
      "INTELLIGENT NOISE CONTROL — Active Noise Cancellation removes up to 2x more background noise.* Transparency mode lets you hear the world around you, and Adaptive Audio seamlessly blends Active Noise Cancellation and Transparency mode for the best listening experience in any environment.* And when you’re speaking with someone nearby, Conversation Awareness automatically lowers the volume of what’s playing.*",
      "IMPROVED SOUND AND CALL QUALITY — The Apple-designed H2 chip helps to create deeply immersive sound. The low-distortion, custom-built driver delivers crisp, clear high notes and full, rich bass in stunning definition. Voice Isolation improves the quality of phone calls in loud conditions.*",
      "CUSTOMIZABLE FIT — Includes four pairs of silicone tips (XS, S, M, L) to fit a wide range of ear shapes and provide all-day comfort. The tips create an acoustic seal to help keep out noise and secure AirPods Pro 2 in place.",
      "DUST-, SWEAT- AND WATER-RESISTANT — Both AirPods Pro and the MagSafe Charging Case are IP54 dust-, sweat- and water-resistant, so you can listen comfortably in more conditions.*",
      "PERSONALIZED SPATIAL AUDIO — With sound that suits your unique ear shape along with dynamic head tracking, AirPods Pro 2 deliver an immersive listening experience that places sound all around you.* You can also listen to select songs, shows and movies in Dolby Atmos.",
      "A HIGHER LEVEL OF CONTROL — Simply swipe, press and hold the stem to manage playback functions using Touch control. And with Siri Interactions, simply nod your head yes or shake your head no when Siri asks if you’d like to hear a message, answer a call or manage a notification.*"
    ],
    "rating": "4.6",
    "scraped_at": "2025-07-17 22:19:23",
    "review_count": 26303
  },
  {
    "merchandise": "amazon",
    "country": "ca",
    "id": "376479b2-6c5e-4901-a02e-04eb38590043",
    "asin": "B0CFZX734J",
    "title": "DJI Mic 2 (2 TX + 1 RX + Charging Case), Wireless Lavalier Microphone, Intelligent Noise Cancelling, 32-bit Float Internal Recording, 820 ft.(250m) Range, Microphone for iPhone, Android, Camera",
    "price": "349.00",
    "main_image_url": "https://m.media-amazon.com/images/I/61O-SRK2ltL.__AC_SX700_SY700_QL70_ML2_.jpg",
    "page_url": "https://www.amazon.ca/dp/B0CFZX734J",
    "description": [
      "Crystal-Clear Audio Makes You Sound Like a Pro - This wireless microphone delivers high-quality audio with brighter, clearer, and more enjoyable vocal recording, making it ideal for interviews, vlogs, and much more.",
      "Ready When You Are - The transmitters and receiver are pre-linked and ready to go, letting you easily save time and improve efficiency. This wireless microphone features USB-C and Lightning adapters for more scenarios.",
      "No More Worrying About Lost Audio - This wireless lavalier microphone's transmitters can each be used as standalone recorders with up to 14 hours of internal recording [4]. And 32-bit float ensures clear audio even if audio levels spike.",
      "Less Noise, Better Vocals - Intelligent noise cancelling makes vocals more clear, even when conducting interviews or shooting videos in locations with erratic and unpredictable sounds.",
      "Extended Range, Expanded Possibilities - Experience stable wireless audio recording within a 250-meter range (FCC) [6], allowing you to shoot and record more flexibly in more scenarios.",
      "Up to 18 Hours of Operation - Say goodbye to battery anxiety. Whether you're livestreaming or making videos in remote locations with fewer charging options, this wireless microphone has got your back.",
      "Includes a receiver, two transmitters (Shadow Black), a charging case, and more for up to 18 hours of use and videos with multiple speakers or stereo sound requirements.",
      "DJI OsmoAudio - Transmitters support direct connection to Osmo Action 5 Pro, Osmo Action 4, or Osmo Pocket 3 without a receiver, delivering premium sound quality and simplifying gear and workflow."
    ],
    "rating": "4.4",
    "scraped_at": "2025-07-17 22:19:47",
    "review_count": 2821
  },
  {
    "merchandise": "amazon",
    "country": "ca",
    "id": "a28b1e15-d696-4ba1-9cf3-1a73ab010b2d",
    "asin": "B00C2PV1ZY",
    "title": "Secrid Men Mini Wallet Genuine Leather RFID Safe Card Case for max 12 cards 16mm slim Brown",
    "price": "184.95",
    "main_image_url": "https://m.media-amazon.com/images/I/71auLTmRDTL._AC_SX522_.jpg",
    "page_url": "https://www.amazon.ca/dp/B00C2PV1ZY",
    "description": [
      "RFID Protected"
    ],
    "rating": "4.5",
    "scraped_at": "2025-07-17 22:19:59",
    "review_count": 503
  },
  {
    "merchandise": "amazon",
    "country": "ca",
    "id": "29746a41-74b4-47df-a6f3-22a86bfe0982",
    "asin": "B0CPFV77W4",
    "title": "Bose Ultra Open Earbuds with Immersive Audio, Open Ear Wireless Clip on Earbuds for Comfort, OpenAudio for Awareness, Up to 48 Hours of Battery Life, Black",
    "price": "379.00",
    "main_image_url": "https://m.media-amazon.com/images/I/51LyCgwzz9L.__AC_SX700_SY700_QL70_ML2_.jpg",
    "page_url": "https://www.amazon.ca/dp/B0CPFV77W4",
    "description": [
      "OPEN YOUR EARS TO THE WORLD: Hear all of what’s around you while enjoying rich, private sound; the wireless earbuds' open ear design says, “I can still hear you” while OpenAudio technology provides you with high-quality, private sound",
      "BE IN THE MUSIC, ANYWHERE EVERYWHERE: With Bose Immersive Audio spatialized sound, these Bluetooth earbuds feel, look good, and bring you closer to your music, so you’re not only listening, you’re in it",
      "FEELS GOOD, STAYS PUT: The Bose Ultra Open Earbuds feature a flexible joint and a light-as-air-grip, simply hook it gently around the back of your ear and you’ll stay open to the world around you with these comfortable earbuds",
      "WATER RESISTANCE WITH IPX4: Get splashed on, dripped on, sprayed on. No worries here. The Bose Ultra Open Earbuds can handle it. Acoustic mesh keeps out moisture and debris, so you can keep on listening",
      "NEVER MISS A BEAT: With up to 7 hours of play time (up to 4 hours with Immersive Audio)*, up to 48 hours of standby***, and the included charging case provides up to an extra 2.5 full charges of power**, you’re equipped with long-lasting battery life",
      "NEW IMPROVED BLUETOOTH CONNECTIVITY: Bluetooth multipoint offers seamless, uninterrupted listening. Switch between your phone, your laptop, and other devices with ease — all without missing a moment",
      "PRESS, PLAY, ENJOY: Simple button controls on these earbuds with microphone make it easy to switch between stereo and immersive modes, giving you instant command; with just a press, effortlessly control your music and answer calls"
    ],
    "rating": "4.0",
    "scraped_at": "2025-07-17 22:20:11",
    "review_count": 3882
  },
  {
    "merchandise": "amazon",
    "country": "ca",
    "id": "3d366438-ff0c-4419-8825-127ace45a9a6",
    "asin": "B0CGGH97G2",
    "title": "Moment Everything Backpack – 17L or 21L Weatherproof Everyday Camera & Laptop Bag (Gen 2, Black, 17L)",
    "price": "210.00",
    "main_image_url": "https://m.media-amazon.com/images/I/71knitIVqGL.__AC_SY700_SX700_QL70_ML2_.jpg",
    "page_url": "https://www.amazon.ca/dp/B0CGGH97G2",
    "description": [
      "Built for Work & Everyday Carry – Designed for commutes, office meetings, and daily travel. Available in 17L and 21L, giving you just the right amount of space for your essentials without added bulk.",
      "Tech & Camera Ready – Features a padded laptop sleeve (fits up to 16” laptops), hidden valuables pocket, and optional camera insert compatibility (sold separately) to safely carry cameras, lenses, and everyday tech.",
      "Smart Organization, No Bulk – Thoughtfully designed storage keeps everything in place with quick-access pockets, internal dividers, and a structured main compartment for seamless packing.",
      "Durable & Weather-Resistant – Made with Urban Ripstop Fabric and a double-layer waterproof coating to protect against rain, spills, and daily wear—keeping your gear safe in any condition.",
      "A Few MTW Backpacks Left – Our MTW Gen 1 backpacks (previous 17L & 21L design) are still available in limited quantities. Same great form, slightly different materials—get one before they’re gone!",
      "Lifetime Guarantee – We stand by our gear. If you’re the original owner and there’s a manufacturing issue, we’ll make it right."
    ],
    "rating": "4.0",
    "scraped_at": "2025-07-17 22:20:23",
    "review_count": 1
  },
  {
    "merchandise": "amazon",
    "country": "ca",
    "id": "065ca1f0-791d-45f0-afdc-791913b0d686",
    "asin": "B0DCW3GB8V",
    "title": "Bellroy Leather Case for Pixel 9 – (Leather Google Phone Case) - Terracotta",
    "price": "16.99",
    "main_image_url": "https://m.media-amazon.com/images/I/71eN+3xrJQL._AC_SY700_.jpg",
    "page_url": "https://www.amazon.ca/dp/B0DCW3GB8V",
    "description": [
      "A Bellroy x Google partnership design",
      "Super slim profile",
      "Gold-rated, Leather Working Group leather",
      "Anodized aluminum buttons",
      "Wireless charging compatible",
      "Soft microfiber lining",
      "Please be aware that lighter colors will adopt signs of wear (and shadows of your denim pockets) quicker than darker colors.",
      "Measures 81mm x 157mm x 12mm / 3.2 inches x 6 inches x 0.5"
    ],
    "rating": "3.6",
    "scraped_at": "2025-07-17 22:20:35",
    "review_count": 35
  },
  {
    "merchandise": "amazon",
    "country": "ca",
    "id": "bfbda7a0-75d6-4335-88b5-8d5c6bdaee1b",
    "asin": "B0D7WZV5LV",
    "title": "Dyson OnTrac™ Over Ear Wireless Headphones - Active Noise Cancelling, Up to 55 Hours Battery Life(2), Customizable, Transparency Mode - CNC Copper",
    "price": "699.99",
    "main_image_url": "https://m.media-amazon.com/images/I/61zm1wme7gL._AC_SY700_.jpg",
    "page_url": "https://www.amazon.ca/dp/B0D7WZV5LV",
    "description": [
      "Block out unwanted noise: 8 Active Noise Cancelling microphones cancel up to 40dB of unwanted noise, for fully-immersive listening. So you don’t miss a beat.",
      "Listen for up to two weeks¹: Up to 55 hours of listening, even with ANC switched on.² And if you need more, a 10-minute charge delivers 2.5 hours of extra battery, 30-minute charge delivers 9.5 hours.²",
      "Enhanced sound range – 6Hz to 21kHz: Hear more, feel more. Go beyond the conventional range to sense every note, beat and whisper the artist intended. A Digital Signal Processor (DSP) reveals expanded sub-bass and high-end brilliance.",
      "Create your color: Make your headphones your own, with customizable outer caps and ear cushions in a range of colors and finishes. Accessories sold separately.",
      "Double-tap ANC control: Just tap the outer cap twice to cycle between ANC modes – Isolation mode, for maximum noise cancellation and Transparency mode to enable conversation.",
      "Crystal-clear calls: Dual beam-forming microphones are targeted to pick up only your voice, not outside noise. So you always sound crisp, whether you’re on a call, making a voice recording or using voice controls – even in a bustling office, or by a busy main road.",
      "Auto off function: Automatically switches off after 30 minutes without being used, to preserve battery life."
    ],
    "rating": "4.0",
    "scraped_at": "2025-07-17 22:20:47",
    "review_count": 114
  },
  {
    "merchandise": "amazon",
    "country": "ca",
    "id": "71732ead-7134-448a-bdc5-67aebc156f72",
    "asin": "B0D983R3N3",
    "title": "ULTRAHUMAN Ring AIR - Sleep & Fitness Tracker, Smart Ring for Women & Men, No App Fee for Standard Features (Size 9)",
    "price": "474.78",
    "main_image_url": "https://m.media-amazon.com/images/I/719RJJXhWuL._AC_SY700_.jpg",
    "page_url": "https://www.amazon.ca/dp/B0D983R3N3",
    "description": [
      "BUY THE SIZING KIT FIRST: Ultrahuman Ring sizes differ from standard ring sizes. Purchase the Ultrahuman Sizing Kit first, which includes a ring sizer, to accurately determine your size. The Ring AIR is available in 10 sizes (5-14), ensuring a comfortable, secure fit. Using the sizing kit helps you avoid returns and exchanges, ensuring you select the right size before purchasing.",
      "COMPREHENSIVE HEALTH TRACKING: The Ultrahuman Ring measures a wide range of metrics including sleep, activity, stress, heart health, movement, workouts, and recovery. Stay on top of your health and fitness goals with detailed insights to optimize your performance and well-being.",
      "WOMEN’S HEALTH INSIGHTS: With Ultrahuman Ring's advanced women's health features, track ovulation, cycles and pregnancy. Through multi-biomarker-based tracking for those looking to conceive, predict a 7-day fertile window and pinpoint ovulation with precision. Access cycle tracking combined with biomarker-based personalized guidance for every phase (Menstruation, Ovulation, Follicular, and Luteal). With Pregnancy Mode, expecting mothers get tailored pregnancy insights throughout each trimester.",
      "ONE APP, NO SUBSCRIPTION: Enjoy all the essential standard features of the Ultrahuman Ring, including sleep, activity, stress, heart rate, heart rate variability, skin temperature and recovery with no subscription — on the Ultrahuman App.",
      "ADVANCED SLEEP TRACKING: Ultrahuman Ring provides detailed insights into all your sleep stages — REM, Deep Sleep, Light Sleep and Wakefulness, along with actionable steps and nudges to improve sleep so you're ready for the day. It also tracks sleep debt, helping you understand your overall sleep quality and identify areas for improvement. Optimize your rest and recovery with accurate, personalized sleep insights.",
      "MINIMAL FORM FACTOR & DURABILITY: The Ultrahuman Ring is crafted from space-grade titanium, offering unmatched strength and lightweight comfort. It’s water-resistant up to 100m, making it perfect for everyday wear, workouts, and even swimming.",
      "HSA/FSA ELIGIBLE: The Ultrahuman Ring is HSA/FSA eligible, allowing you to use your health savings or flexible spending account to purchase the ring. This makes it easier to invest in your health and wellness while saving on taxes, making it a smart choice for anyone looking to optimize their fitness and recovery."
    ],
    "rating": "4.0",
    "scraped_at": "2025-07-17 22:20:59",
    "review_count": 68
  },
  {
    "merchandise": "amazon",
    "country": "ca",
    "id": "3c028e47-5b8e-4ba3-ac62-0d70c15e05cd",
    "asin": "B0CGXYNWBH",
    "title": "Ray-Ban Meta Glasses, Wayfarer - Matte Black, Polarized Gradient Graphite",
    "price": "409.99",
    "main_image_url": "https://m.media-amazon.com/images/I/51GYi1kNaBL._AC_SX679_.jpg",
    "page_url": "https://www.amazon.ca/dp/B0CGXYNWBH",
    "description": [
      "Get the most out of the moment with iconic Ray-Ban style and technology by Meta. Now featuring frames for a broader range of face shapes.",
      "Own the moment with Ray-Ban Meta glasses. Capture your point of view, enjoy hands-free connection, listen to music and ask Meta AI* questions about the world around you.",
      "Video call hands-free and share your POV so others can feel like they’re right there with you whether you’re cooking, watching a game or sharing core memories.",
      "Capture your world with an updated camera and built-in edit features. Take high-quality photos and videos hands free or livestream your point of view.",
      "Discreet open-ear speakers let you enjoy rich audio quality, music and calls without losing the ambient sounds of your surroundings",
      "Use your voice to make calls and send messages on WhatsApp, Messenger and SMS—right from your smart glasses."
    ],
    "rating": "4.0",
    "scraped_at": "2025-07-17 22:21:11",
    "review_count": 2320
  },
  {
    "merchandise": "amazon",
    "country": "ca",
    "id": "9607d0f2-b106-44b7-ba0f-5b32820518bf",
    "asin": "B005CQ2ZY6",
    "title": "Zoom H2n Handy Recorder",
    "price": "229.99",
    "main_image_url": "https://m.media-amazon.com/images/I/71Wt23ld8kL._AC_SY700_.jpg",
    "page_url": "https://www.amazon.ca/dp/B005CQ2ZY6",
    "description": [
      "Over 20 hours of operation using two standard aa batteries",
      "Key control, a-b repeat, file dividing, normalize, mp3 post-encode, marker and surround mixer",
      "Additional functions include lo-cut filter, compressor/limiter, auto gain, pre-rec, auto-rec, tuner, metronome, variable speed playback",
      "Records in wav up to 24-bit/96khz and mp3 up to 320kbps",
      "File types supported: mav,mp3"
    ],
    "rating": "4.4",
    "scraped_at": "2025-07-17 22:21:35",
    "review_count": 2644
  },
  {
    "merchandise": "amazon",
    "country": "ca",
    "id": "aa128261-8722-4f5d-b07f-044b352806a8",
    "asin": "B0D9KNWMZH",
    "title": "Canon EOS R5 Mark II Body",
    "price": "5,614.99",
    "main_image_url": "https://m.media-amazon.com/images/I/61aKl8DI8CL.__AC_SY700_SX700_QL70_ML2_.jpg",
    "page_url": "https://www.amazon.ca/dp/B0D9KNWMZH",
    "description": [
      "Completely NEW Canon designed full-frame back-illuminated stacked CMOS 45MP sensor.",
      "Fast sensor read-out speeds allow for up to 30 fps electronic shutter performance.",
      "New focus system upgrades include eye control focus, and the ability to maintain focus on a subject even when obscured briefly.",
      "Capture video and stills simultaneously with no interruption.",
      "Action Priority uses data to interpret the scene and predict the main subject to lock focus on it in action scenarios."
    ],
    "rating": "4.4",
    "scraped_at": "2025-07-17 22:21:47",
    "review_count": 65
  },
  {
    "merchandise": "amazon",
    "country": "ca",
    "id": "0f97dd88-689d-4cae-a222-f8a5276fa2b6",
    "asin": "B07P5H9T41",
    "title": "LEATHERMAN, Free P4 Multitool with Magnetic Locking, One Size Hand Accessible Tools and Premium Nylon Sheath and Pocket Clip, Made in The USA",
    "price": "373.92",
    "main_image_url": "https://m.media-amazon.com/images/I/71X-l6Ps+wL._AC_SX522_.jpg",
    "page_url": "https://www.amazon.ca/dp/B07P5H9T41",
    "description": [
      "Premium Multi-Tool Experience: Introducing the P-Series, our most advanced multipurpose plier experience to date; A brand-new platform, magnetic closing and outside-accessible tools",
      "Effortless Access: The Premium Nylon Sheath keeps your multi-tool within reach; Crafted for durability and quick access, ensuring your tools are protected and ready for immediate use",
      "Enhanced Portability: The removable pocket clip and premium nylon sheath allows for choices in carry options; Securely attach the P4 to your pocket or belt, making it accessible and easy to retrieve",
      "Innovative Magnetic System: The P4 features a revolutionary magnetic locking system; Reduces friction and provides haptic feedback; Smooth, quick access to tools, ensuring reliability and ease of use for all your tasks",
      "Leatherman Legacy: With a 25-year warranty, Leatherman products promise unmatched quality and durability; Proudly made in the USA, we support your adventures and projects with innovative, reliable multi-tools"
    ],
    "rating": "4.8",
    "scraped_at": "2025-07-17 22:21:59",
    "review_count": 3170
  },
  {
    "merchandise": "amazon",
    "country": "ca",
    "id": "c761789c-7390-4181-aa5d-e475f3abd766",
    "asin": "B0CYC11T41",
    "title": "NiSi NC UV Filter for FUJI FUJIFILM X100VI / X100V / X100F / X100T / X100S / X100 - 49mm Lens Protector Camera Filter (Black)",
    "price": "51.00",
    "main_image_url": "https://m.media-amazon.com/images/I/71gvwdoqH0L._AC_SY700_.jpg",
    "page_url": "https://www.amazon.ca/dp/B0CYC11T41",
    "description": [
      "COMPATIBILITY WITH FUJIFILM X100 SERIES: Seamlessly designed for Fujifilm X100 series cameras, including X100, X100S, X100F, X100T, X100V, and X100VI, the black frame of this ultraviolet filter, perfectly matches your camera's aesthetic. A must-have for Fuji X100 accessories lovers, this camera lens protector filter ensures compatibility with X100V and X100VI lens caps. Upgrade your Fujifilm digital camera setup today with a premium UV protection filter designed for perfection.",
      "EASY INSTALLATION AND SECURE FIT: Effortlessly attach the NiSi camera lens protector filter by removing the standard mounting ring from your Fujifilm camera lens and threading it on. This UV filter is compatible with the lens cap for the X100V and X100VI, ensuring a perfect fit every time. Ideal for camera & photo filters enthusiasts and those seeking hassle-free setup, this filter simplifies your photography routine and a cool gift for photographer.",
      "ULTRAVIOLET LIGHT PROTECTION: This camera lens protector filter integrates an advanced UV filter technology that effectively blocks ultraviolet light below 365nm while maintaining 99.3% light transmittance, ensuring unmatched image clarity. This UV lens filter delivers superior ultraviolet lens filtering for Fuji cameras, making it essential for vibrant, professional photography, a perfect addition to your camera accessories or a photographer's gift.",
      "PROTECTS YOUR LENS FROM DAMAGE: Shield your precious Fujifilm lens with this durable camera lens protector filter. It guards against scratches, dust, and moisture, ensuring your lens remains pristine during outdoor shoots. An ideal digital camera accessories addition, for photographers needing a reliable ultraviolet filter, and those seeking a cool gift for photographer. This UV camera lens filter provides long-lasting protection for all environments.",
      "ADVANCED NANO COATING: This camera lens protector filter features a proprietary waterproof nano coating, this filter reduces reflections while adding a scratch-resistant, dust-proof layer. Experience enhanced image quality and durability with this UV filter, ideal for Fujifilm x100 accessories and professional-grade photography gear. Take your Fuji digital camera to new heights with an advanced ultraviolet camera filter that offers premium performance and UV protection."
    ],
    "rating": "4.4",
    "scraped_at": "2025-07-17 22:22:11",
    "review_count": 232
  },
  {
    "merchandise": "amazon",
    "country": "ca",
    "id": "e2424121-a403-41a3-8c7a-1f6f4828730c",
    "asin": "B0D9138ZXM",
    "title": "Google Pixel Watch 3 (41mm) - Android Smartwatch with Heart Rate Tracking, Advanced Running from Fitbit, Fitness Insights, 24-Hour Battery - Matte Black Aluminum Case - Obsidian Band - Wi-Fi",
    "price": "399.99",
    "main_image_url": "https://m.media-amazon.com/images/I/614qNwigROL._AC_SX522_.jpg",
    "page_url": "https://www.amazon.ca/dp/B0D9138ZXM",
    "description": [
      "The Google Pixel Watch 3 is designed for performance, with advanced fitness from Fitbit[1,2]; the 41mm screen is twice as bright and 10% larger than before, making it easier to see your stats and info[1]",
      "Maximize your performance with advanced running features; build custom run workouts and get real-time guidance and advanced form tracking[3]",
      "Enhance your run routine with Fitbit Premium; Google AI uses your goals, past runs, and readiness to power personalized run recommendations[3]",
      "Know what your body is ready for each day with readiness; it uses sleep, resting heart rate, and heart rate variability to show if you’re ready to take on a workout or prioritize recovery[3]",
      "Cardio load measures how hard your heart works so you can see how hard you’ve pushed; compare trends to see if you’re under- or over-training[3]; and receive a daily target based on cardio load and readiness levels",
      "Fitbit Morning Brief delivers a summary of your most important health and fitness metrics, like how you slept and your readiness score, to help you plan your day",
      "Get 24 hours of battery with the always-on display and up to 36 hours in Battery Saver mode[4]; and the watch charges 20% faster than the Pixel Watch 2[5]"
    ],
    "rating": "4.5",
    "scraped_at": "2025-07-17 22:22:23",
    "review_count": 1002
  },
  {
    "merchandise": "amazon",
    "country": "ca",
    "id": "86dc7cf4-00a0-4614-9889-cfef7f1f1249",
    "asin": "B0B93YKQT3",
    "title": "Focal Bathys High-Fidelity Bluetooth Noise Cancelling Headphones",
    "price": "999.00",
    "main_image_url": "https://m.media-amazon.com/images/I/81EaKmWszJL._AC_SY700_.jpg",
    "page_url": "https://www.amazon.ca/dp/B0B93YKQT3",
    "description": [
      "Refined real leather and microfiber headband Incomparably soft, comfortable and refined. Earpads provide insulation and comfort for any head shape Easily replaceable",
      "1 5/8\" (40mm) Aluminum-Magnesium speaker drivers, made in France A naturally detailed, pure sound with impact - 1/8\" (3.5mm) Jack and USB-C outlets Limitless connectivity",
      "Battery life of over 30 hours in Bluetooth and active noise cancelling mode - Aluminum mechanical construction Reliability and resistance on the move - Magnesium yoke for increased lightness",
      "Backlit logo The flame lights up - Fast charging-compatible: 5 extra listening hours in 15 minutes - Two optimized noise-cancelling modes and a transparency mode, ideal for any journey",
      "Active noise cancelling technology and transparency mode Immerse yourself in your music or interact with your environment, as required."
    ],
    "rating": "4.3",
    "scraped_at": "2025-07-17 22:22:35",
    "review_count": 375
  }
]