[
  {
    "merchandise": "amazon",
    "country": "ca",
    "id": "0ddc3fce-8610-440c-9d79-287e336f8804",
    "asin": "B09KLZLYM6",
    "title": "Fabric Resistance Bands for Working Out – Booty Bands for Women and Men – Exercise Set for Legs and Glutes – Fitness Bands",
    "price": "27.97",
    "main_image_url": "https://m.media-amazon.com/images/I/81efP4ZQm+L._AC_SX522_.jpg",
    "page_url": "https://amazon.ca/dp/B09KLZLYM6",
    "description": [
      "[Easy to Use] - Each workout bands resistance level is different but they are the same length, so you won't need to readjust your range of motion. Squat bands are grippy to ensure the fitness band doesn’t slide up or down",
      "[Top Quality] - Work out bands are made from a durable elastic fabric material. With fabric bands, you don’t have to worry about tears or stretching them out and having them snap as our hip bands are sewn with high-quality cotton polyester stretch fabric blended with latex threads",
      "[Versatile] - Elastic bands for exercise such as Squats, Lunges, Crunches, Straight Leg Raises and Leg bands for working out butt, glutes and more. Glute bands for women and men will help with your butt workout, leg workout band build that thick booty",
      "[Small and Light] - Our Exercise resistance bands will fit into your gym bag, backpack or even a purse. Resistant bands for exercise workouts at the gym, at home, at the office or while travelling. They will sure make your body sweat!",
      "[Guarantee] - Tribe Lifting products are designed in North America and manufactured with a great attention to detail. If there is anything at all that is not up to a standard, we will replace or refund the product for you no questions asked"
    ],
    "rating": "4.6",
    "scraped_at": "2025-07-17 22:51:13",
    "review_count": 3465
  },
  {
    "merchandise": "amazon",
    "country": "ca",
    "id": "35a055dd-ca4c-4b45-bd83-e1ebcb4be9d1",
    "asin": "B00DDXWFY0",
    "title": "DASH Rapid 6 Capacity Electric Cooker for Hard Boiled, Poached, Scrambled Eggs, or Omelets with Auto Shut Off Feature, One Size, Black",
    "price": "29.55",
    "main_image_url": "https://m.media-amazon.com/images/I/61pF6D-ulVL._AC_SX569_.jpg",
    "page_url": "https://amazon.ca/dp/B00DDXWFY0",
    "description": [
      "SATISFACTION GUARANTEED: Dash Rapid Egg Cooker is the ORIGINAL (and most trusted) egg cooker on the market, for perfect eggs, your way, EVERY TIME, we guarantee it!",
      "SIX EGG CAPACITY: Cook up to 6 eggs in soft, medium, or hard boiled firmness, while saving time and water. Eggs come out consistently perfect with shell easy to peel, and clean up is snap!",
      "QUICK + EASY: Short on time? Simply choose your preferred number eggs and set the timer. The auto-shut off function prevents overcooking.",
      "VERSATILE: This is the PERFECT appliance for picky eaters, large families, or those who have busy schedules. Hard boiled eggs, soft boiled eggs, poached eggs, scrambled eggs, individual omelets, and all within minutes of the push start button - it couldn’t be easier!",
      "COMPACT + LIGHTWEIGHT: Weighing 1lb, the Dash Rapid Egg Cooker is your MUST-HAVE for that first apartment, smaller kitchen, college dorm, or camper/RV traveling Plus, its sleek design and trendy color options will accent any kitchen space (bonus all included accessories fit inside, taking up even LESS space). Boils up to 6 eggs at a time, poaches up to 2 eggs with its separate poaching tray, plus it makes omelets. Cord length: 33\""
    ],
    "rating": "4.5",
    "scraped_at": "2025-07-17 22:51:37",
    "review_count": 123500
  },
  {
    "merchandise": "amazon",
    "country": "ca",
    "id": "b16f6ac0-feb7-4c7d-ac3c-6864ca1c3f13",
    "asin": "B0CD3WJTH9",
    "title": "CURSOR FITNESS Home Folding Treadmill with Pulse Sensors, 2.5 HP Quiet Brushless, 7.5 MPH, 265 lbs Capacity",
    "price": "339.99",
    "main_image_url": "https://m.media-amazon.com/images/I/61Coc3e+inL._AC_SX522_.jpg",
    "page_url": "https://amazon.ca/dp/B0CD3WJTH9",
    "description": [
      "QUIET BRUSHLESS MOTOR: CURSOR FITNESS brushless motor with max 2.5 HP provides efficient, reliable, and low-maintenance operation, while providing speeds of 7.5 MPH and emitting only 40-65 dB of noise, ensuring your workouts won't disturb your downstairs or next-doors",
      "REAL TIME HEART RATE: Monitor your target heart rate in real-time with the built-in handrail heart sensors. Keeping track of your pulse rate during exercise ensures you are working out correctly and efficiently",
      "DIGITAL LED CONSOLE: Keep track of your workout progress in real-time as it displays your time, speed, distance, calories burned, and heart rate. Choose from 12 preset programs offering different exercise intensities or customize your personalized workout routine",
      "EASY FOLDING: This treadmill can be quickly folded and stored within 15 seconds, just loosen the knob at the joint of the column and the running table to achieve rapid folding and storage, and only need to tighten the knob again when the next use",
      "CURSORCARE SERVICE: Our dedicated CursorCare service team, based in Los Angeles offers 24/7 support with 100% satisfaction, ensuring you have no worries during your shopping and usage experience",
      "5 YEARS WARRANTY: CURSOR FITNESS Treadmill includes an extended 5-year warranty, covering the frame structure for 5 years and parts for 1 year. With CursorCare Service, your satisfaction is fully guaranteed, allowing you to use our products worry-free"
    ],
    "rating": "4.3",
    "scraped_at": "2025-07-17 22:51:50",
    "review_count": 2376
  },
  {
    "merchandise": "amazon",
    "country": "ca",
    "id": "5c3d9c9f-e85a-4186-bfb6-28c9c9f0ce8c",
    "asin": "B0BCDJRPFP",
    "title": "LCHLZZ 4 Pack Snack Containers, Divided Bento Snack Box, 4 Compartments Reusable Meal Prep Lunch Containers for Kids Adults, Food Storage Containers for School Work Travel",
    "price": "44.43",
    "main_image_url": "https://m.media-amazon.com/images/I/71BqsV+gFzL._AC_SY700_SX700_.jpg",
    "page_url": "https://amazon.ca/dp/B0BCDJRPFP",
    "description": [
      "Easy Open Lids --- The snack containers lids stays perfectly in place when inside a lunch bag and it is easy to open. The each section seals so nothing leaks to another section! (Not suitable for liquids)",
      "Reusable Food Material --- 4 compartment snack containers is made of premium and BPA-free wheat straw material that can be used multiple times, please use our wheat straw snack containers instead of disposable snack containers to protect the environment",
      "Meal Prep Portion Control --- 4 perfectly divided compartments make it easy to pack a variety of snacks and fruits. Each compartment can hold 4oz of food, perfect for portion control and satisfying any size appetite from anyone",
      "Lightweight Stackable --- It is lighter than other bento boxes and can easily fit into a backpack or lunch bag. You can enjoy homemade food anytime. These food containers can be easily stacked in the fridge and cabinets without taking up too much space. Great choice for work, and travel",
      "Microwave, Dishwasher Freezer Safe --- These snack containers are very easy to clean and hold up well in the dishwasher. Each set includes 4 different colored snack containers that are easy to distinguish."
    ],
    "rating": "4.7",
    "scraped_at": "2025-07-17 22:52:02",
    "review_count": 746
  },
  {
    "merchandise": "amazon",
    "country": "ca",
    "id": "d3431678-eb6d-4eb1-9f05-bef7a538b016",
    "asin": "B07XGQ9RM3",
    "title": "Amazon Basics 20\" High Velocity Industrial Fan, Floor Fan, with 3 Speeds, Tilt Head, ETL-Listed Safety Compliance, Metal Housing/Blades, Ideal for Industrial/Commercial Space/Garage/Gym, 125W, Black",
    "price": "26.99",
    "main_image_url": "https://m.media-amazon.com/images/I/81CF4KiESzL._AC_SX569_.jpg",
    "page_url": "https://amazon.ca/dp/B07XGQ9RM3",
    "description": [
      "POWERFUL PERFORMANCE: The fan generates a substantial 3,542 CFM (Cubic Feet per Minute) airflow output at high speed, effectively cooling large areas such as warehouse floors, automotive repair shops, manufacturing facilities, and expansive indoor spaces with rapid air circulation.",
      "INDUSTRIAL STRENGTH & DURABILITY: The fan features commercial-grade metal construction and three heavy-duty aluminum blades, delivering consistent performance in demanding environments like workshops, retail spaces, and other commercial settings (e.g., garage, gym).",
      "PERSONALIZED AIRFLOW: This fan offers three speed options and an adjustable tilt head mechanism that directs airflow where you need it most",
      "WIDE COVERAGE: The pivoting mechanism ensures air circulation and even temperature distribution throughout large spaces",
      "QUICK SETUP: The fan features a tool-free assembly process that gets your cooling solution up and running without hassle",
      "SAFETY CERTIFIED: This fan is ETL listed, meeting rigorous North American safety standards for electrical appliances, ensuring reliable and safe operation in both commercial and residential environments."
    ],
    "rating": "4.4",
    "scraped_at": "2025-07-17 22:52:14",
    "review_count": 5834
  },
  {
    "merchandise": "amazon",
    "country": "ca",
    "id": "614377fe-0fe8-4232-902f-e47223c39814",
    "asin": "B0B83ZNGC1",
    "title": "Downy Rinse & Refresh Laundry Odor Remover And Fabric Softener, Fresh Lavender, 48 Fl Oz, Safe On All Fabrics, Gentle On Skin, He Compatible",
    "price": "11.86",
    "main_image_url": "https://m.media-amazon.com/images/I/71gso1SM5JL._AC_SX522_.jpg",
    "page_url": "https://amazon.ca/dp/B0B83ZNGC1",
    "description": [],
    "rating": "4.6",
    "scraped_at": "2025-07-17 22:52:26",
    "review_count": 2499
  },
  {
    "merchandise": "amazon",
    "country": "ca",
    "id": "65ddd859-85ee-441b-a145-2f23872a7a43",
    "asin": "B00A21NRNO",
    "title": "POWERBLOCK Elite EXP Adjustable Dumbbells, Sold in Pairs",
    "price": "610.82",
    "main_image_url": "https://m.media-amazon.com/images/I/611GyULs0qL._AC_SX679_.jpg",
    "page_url": "https://amazon.ca/dp/B00A21NRNO",
    "description": [
      "ADJUSTABLE DUMBBELLS SET: Elevate your fitness and performance with strength-training equipment that adjusts with you. These PowerBlock dumbbells have a range of 5-50 pounds per hand, a padded handle, and easy weight identification.",
      "COMPACT & PORTABLE: The adjustable, convenient, and compact dumbbells provide innovative strength training for an easy-to-use solution. Bring the workout with you anywhere. Dimensions are 12″L x 6″ W x 6″ H.",
      "EASY & QUICK ADJUSTABILITY: Quickly adjust the weight set up or down for your exercise with the secure magnetic polypropylene pin. Increments include 2.5 (adder weight), 5, 7.5, 10, 15, 17.5, 20, 25, 27.5, 30, 35, 37.5, 40, 45, 47.5, 50 lbs. per hand.",
      "LONG LASTING FOR YEARS OF USE: This dumbbell set is engineered with a reliable build for years of use. Replace 16 pairs of dumbbells, equivalent to 825 lbs. of free weights for an all-in-one strength training solution. Comes with a 5-year warranty.",
      "EXPANDABLE WITH EXPANSION KITS: PowerBlock offers Elite EXP 50 Stage 2 and Stage 3 Expansion Kits to increase the weight to 70 or 90 pounds per hand as your fitness level grows (sold separately). The Elite EXP's expansions and accessories are not compatible with the Elite USA 90's expansions and accessories."
    ],
    "rating": "4.5",
    "scraped_at": "2025-07-17 22:52:38",
    "review_count": 2436
  },
  {
    "merchandise": "amazon",
    "country": "ca",
    "id": "2079f642-826f-4359-9729-4526c348a9c5",
    "asin": "B07F25L7QK",
    "title": "Sportneer Adjustable Ankle Weights 1 Pair 2 4 6 8 10 Lbs Leg Weight Straps for Women Men Kids, Weighted Ankle Weights Set for Gym,Fitness, Workout,Walking, Jogging,1-5 lbs Each Pack, 2 Pack 2-10 lbs",
    "price": "37.04",
    "main_image_url": "https://m.media-amazon.com/images/I/91wFDFx-g3L._AC_SX522_.jpg",
    "page_url": "https://amazon.ca/dp/B07F25L7QK",
    "description": [
      "COMES IN A PAIR: Comes in 2 ankle weights, EACH ankle weight weighs up to 5 lbs, 2 PACK of ankle weights up to 10 lbs",
      "ADJUSTABLE LEG WEIGHTS: 5 removable sand pockets for each ankle weight, each pocket weighs 0.97 lbs, total weights (each ankle weight) can be adjusted from 1-5 lbs by adding or taking out the inserts",
      "ONE SIZE FITS ALL: These universal-size ankle weights extend its length to 14.56’’, with easy to adjust velcro straps to provide a greater fit for ankles and wrists of all sizes",
      "ADD WORKOUT INTENSITY: Add more resistance to daily workout, walking, jogging, core training, fitness, aerobics, gym and many other exercises, helping increase strength, rehabilitate muscles, improve balance, and assist physical therapy",
      "QUALITY & COMFORT: Made of neoprene exterior, reinforced stitching and sturdy outer trim, you could feel its softness when hold in your hands"
    ],
    "rating": "4.5",
    "scraped_at": "2025-07-17 22:52:53",
    "review_count": 13770
  },
  {
    "merchandise": "amazon",
    "country": "ca",
    "id": "5357a9bb-0a5b-4f37-8045-2987771fe66f",
    "asin": "B09X5J4HDP",
    "title": "Gogokiwi Large Yoga Mat (6'x4') Extra Wide 1/4 Inch Thick Workout Mat for Home, Non Slip Fitness & Exercise Mat for Home Gym, Yoga, Pilates, Stretching, and Floor (Neutral Nature)",
    "price": "162.57",
    "main_image_url": "https://m.media-amazon.com/images/I/71X7KmQlYfL._AC_SX522_.jpg",
    "page_url": "https://amazon.ca/dp/B09X5J4HDP",
    "description": [
      "【Expand Your Workout Space】With 72 x 48 inches, our exercise mat for home workout offers 112% more exercise space than traditional mats. Perfect for home fitness, it gives you the freedom to move without feeling confined",
      "【Eco-friendly & Sustainable】 Made from premium Recfoam, our workout mat for home gym is 100% recyclable, ensuring no environmental harm during its lifecycle. Exercise with peace of mind knowing you're making a green choice",
      "【Dual-sided for Versatility】Our extra wide yoga mat features two different colors and patterns on each side, enhancing its anti-slip properties and allowing you to switch sides based on your mood or workout needs",
      "【Superior Support And Resilience】The high-strength, high-rebound properties of premium Recfoam material provide excellent support and cushioning, protecting your joints during workouts and ensuring balance and stability",
      "【Easy Cleaning & Convenient Storage 】Thanks to its closed-cell material, our large exercise mat prevents sweat absorption, making it easy to clean and maintain for long-term use. Additionally, it comes with velcro straps for hassle-free storage"
    ],
    "rating": "4.5",
    "scraped_at": "2025-07-17 22:53:05",
    "review_count": 25
  },
  {
    "merchandise": "amazon",
    "country": "ca",
    "id": "a8a0b997-f90b-43a6-9142-52890576d7f3",
    "asin": "B0CHB3L2Z4",
    "title": "BEAUTYPEAK Full Length Mirror, 71\"x26\" Standing Hanging or Leaning Against Wall Floor Mirrors Body Dressing Wall-Mounted for Living Room, Bedroom with Aluminum Alloy Thin Frame, Black",
    "price": "300.44",
    "main_image_url": "https://m.media-amazon.com/images/I/71tyLLsbA6L.__AC_SX700_SY700_QL70_ML2_.jpg",
    "page_url": "https://amazon.ca/dp/B0CHB3L2Z4",
    "description": [
      "Full-Length Mirror: This is a 71\"x26\" full-size mirror, enough for you to see your entire figure in a single glance and bring you light, beauty, and confidence",
      "Classic Design: The glass is surrounded by a thin aluminum alloy frame, which is very durable and easy to maintain and clean. The classic and simple thin frame design is perfect for the retro",
      "High-quality Glass: The full body mirror is made of high-quality shattervue glass which can provide super HD imaging and undistorted reflection. The back is covered with an explosion-proof membrane",
      "Easy Installation: Our full-length mirrors can be leaned to the wall or free-standing with the stand anywhere in your room. The humanized hook design and complete accessories make installation",
      "100% Satisfaction Customer Service: If the mirror is damaged when it arrives, or you don't absolutely love our product, please contact us in time and we'll offer you 24/7 customer service"
    ],
    "rating": "4.4",
    "scraped_at": "2025-07-17 22:53:39",
    "review_count": 1218
  },
  {
    "merchandise": "amazon",
    "country": "ca",
    "id": "3a3a0947-bc9e-4417-953a-a19b2190fc5d",
    "asin": "B0B7H3RTM4",
    "title": "CRZ YOGA Butterluxe High Waisted Lounge Legging 28'' - Workout Leggings for Women Buttery Soft Yoga Pants",
    "price": "278.00",
    "main_image_url": "https://m.media-amazon.com/images/I/613tc8WlhNL._AC_SX522_.jpg",
    "page_url": "https://amazon.ca/dp/B0B7H3RTM4",
    "description": [],
    "rating": "4.4",
    "scraped_at": "2025-07-17 22:53:51",
    "review_count": 4125
  },
  {
    "merchandise": "amazon",
    "country": "ca",
    "id": "366ce19a-b52a-406b-bc25-61fc956c850c",
    "asin": "B0CQT1JGQQ",
    "title": "Midea MERC04C4BAWW 3.5 Cubic Feet Chest Freezer, White",
    "price": "278.59",
    "main_image_url": "https://m.media-amazon.com/images/I/61A5Teih1nL._AC_SX679_.jpg",
    "page_url": "https://amazon.ca/dp/B0CQT1JGQQ",
    "description": [
      "Large Capacity – Offers ample storage space for frozen or fresh foods—and works perfectly as a second freezer for your garage or basement.",
      "Convertible – Easily converts between freezer and fridge modes to suit your ever-changing food storage needs.",
      "Garage Ready – Designed and tested to operate efficiently in non-climate-controlled environments. (38°F to 110°F in fridge mode, 0°F to 110°F in freezer mode)",
      "Power Outage Protection – Keeps items frozen for up to 48 hours after losing power.",
      "Considerable Design – adjustable legs allow you to adjust the height to fit any placement. Removable plastic basket make it easily to storage foods.",
      "Exterior Control Panel – Easily monitor and adjust temperature settings without having to open the lid and release cold air."
    ],
    "rating": "4.4",
    "scraped_at": "2025-07-17 22:54:03",
    "review_count": 70
  },
  {
    "merchandise": "amazon",
    "country": "ca",
    "id": "a5929eda-1e8a-4a43-9db7-c0474ab5d581",
    "asin": "B08RBXNKL8",
    "title": "Bbtops Pilates Bar Kit with Resistance Bands,Pilates Bar with Stackable Bands Workout Equipment for Legs,Hip,Waist and Arm,Exercise Fitness Equipment for Women & Men Home Gym Yoga Pilates",
    "price": "51.63",
    "main_image_url": "https://m.media-amazon.com/images/I/71P6hVfE7AL.__AC_SY700_SX700_QL70_ML2_.jpg",
    "page_url": "https://amazon.ca/dp/B08RBXNKL8",
    "description": [
      "【Bbtops Pilates Bar】- The connecting point where the ends of bands is attached to carabiner by the Nylon fabric,not the bands connecting carabiners directly,which quite different from that of others,providing absolutely much stronger durability when training.Resistance bands Carrying it conveniently to your home,office,gym or some outdoor occasion,perfect for workout fitness,like Yoga,Pilates,band resistance exercising and other training purpose",
      "【Customized Pilates Bar Kit】- It comes with 3-section steel rod with quite soft and comfortable foam (anti-slip and sweat-proof),,which enables you hold it easily and have a steady,safe exercising.In addition,there comes with 2 kinds of bands with strong resistance(30lbs,40lbs)",
      "【All in 1-Full Body Workout 】- The workout equipment could help shape body,training muscles,etc.You can put these 2 kinds of resistance bands together on each side,if you want to increase the intensity of tension.Also,you can use the same weight resistant bands,attached to each side for light weight resistance.The 3 detachable steel rod could be assemble to the length when you training",
      "【Keep Body in Good Shape】- The pilates exercise bar sets could train your arms.legs,hips,waist,neck and back,etc as simply use it to train in different exercise ways,keep your body in good shape",
      "【Pilates Equipment】- Our Pilates bar kit with resistance bands can be used for a wide range of exercises, including pilates, yoga, stretching, strength training, and more. It can help you improve your strength, flexibility, and balance. which is strong, durable, and non-slip."
    ],
    "rating": "4.3",
    "scraped_at": "2025-07-17 22:54:37",
    "review_count": 3892
  },
  {
    "merchandise": "amazon",
    "country": "ca",
    "id": "43fec4ec-1b35-4055-849f-ac8bb9f4be55",
    "asin": "B000Q5XO4S",
    "title": "CLIF BUILDER'S - Protein Bar - Vanilla Almond - (2.4 Ounce Bar, 12 Count)",
    "price": "64.48",
    "main_image_url": "https://m.media-amazon.com/images/I/81V20HrC2TL._AC_SX522_.jpg",
    "page_url": "https://amazon.ca/dp/B000Q5XO4S",
    "description": [
      "If vanilla’s more your speed, go for this almond and protein-packed treat.",
      "20g of high-quality protein to help build and repair muscle (see Nutrition Facts for saturated fat content)",
      "Carbohydrates to help you sustain your workout",
      "Non-GMO Ingredient Sources",
      "Low glycemic (low glycemic-index foods digest slowly for prolonged levels of energy)"
    ],
    "rating": "4.5",
    "scraped_at": "2025-07-17 22:54:49",
    "review_count": 1749
  },
  {
    "merchandise": "amazon",
    "country": "ca",
    "id": "7effe042-eca0-4aa5-9144-aa093a47fca7",
    "asin": "B0CLL75H8Z",
    "title": "Pushup Handles Exercise Equipment",
    "price": "28.93",
    "main_image_url": "https://m.media-amazon.com/images/I/61E6rPtneBL._AC_SX522_.jpg",
    "page_url": "https://amazon.ca/dp/B0CLL75H8Z",
    "description": [
      "Pushup Handles Exercise Equipment"
    ],
    "rating": "4.5",
    "scraped_at": "2025-07-17 22:55:01",
    "review_count": 81
  },
  {
    "merchandise": "amazon",
    "country": "ca",
    "id": "94466242-cb35-4430-8ebe-9a7211abb9a5",
    "asin": "B08DVFP5WQ",
    "title": "PRO SPIN All-in-One Ping Pong Set - Retractable Ping Pong Net for Any Table, High-Performance Ping Pong Paddles, Pro-Quality Table Tennis Balls, Storage Case | Great Gift for Indoor & Outdoor Games",
    "price": "69.99",
    "main_image_url": "https://m.media-amazon.com/images/I/81WmEShER5L.__AC_SX700_SY700_QL70_ML2_.jpg",
    "page_url": "https://amazon.ca/dp/B08DVFP5WQ",
    "description": [
      "SET UP PING PONG IN SECONDS - Instantly transform any table into a ping pong table with our ultra-convenient portable ping pong set. Hassle-free setup: adjust the net to match any table's width; engage the blue lever to open the clamps; and securely attach it to the side of any table. Have a blast playing ping pong anywhere with this quick and easy setup, creating unforgettable games on the go.",
      "MAKES A GREAT GIFT - Surprise your friends, family, colleagues, or anyone with the perfect gift idea for boys, girls, teens, and adults alike. Ideal for birthday gifts, graduation gifts, Christmas gifts, Mother's Day gifts, Father's Day gifts, office gifts, any fun special occasion. Spread joy and excitement with this great game for adults and a fun family ping pong set!",
      "USE INDOOR OR OUTDOOR - Unleash family excitement anytime, anywhere with our retractable ping pong net. Fits tables up to 72\" wide (wider than other retractable nets) and 2\" thick, perfect for dining, coffee, kitchen, folding, outdoor tables & more. Enjoy indoor & outdoor games at home, at the office, parks, birthdays, picnics, work events, or the beach, reveling in hours of entertainment.",
      "HIGH-PERFORMANCE PING PONG PADDLES & BALLS - Our ping pong rackets boast upgraded sponge and rubber, elevating your game with enhanced spin and overall performance. The ergonomic and lightweight handles ensure a comfortable grip for precise control and swift moves. Meanwhile, our 3-star training ping pong balls deliver consistent bounce, incredible spin, and unparalleled durability.",
      "PRO-SPIN 100% HAPPINESS GUARANTEE: Our local customer service team is committed to providing the best support experience. If your set doesn’t arrive in perfect condition, let us know, and we’ll replace it! Buy your new portable ping pong set risk-free, knowing we’ll do everything possible to ensure you’re 100% happy with your order.",
      "PROUDLY CANADIAN OWNED AND DESIGNED – As a fully Canadian owned company, we design every piece of gear with local players in mind. Whether it’s a casual match or fierce competition, our products deliver the reliability, durability, and performance that you need."
    ],
    "rating": "4.6",
    "scraped_at": "2025-07-17 22:55:35",
    "review_count": 6043
  },
  {
    "merchandise": "amazon",
    "country": "ca",
    "id": "284b202b-8b0b-49c3-8f04-5f9fb66837d9",
    "asin": "B0B5F9SZW7",
    "title": "Fitbit Inspire 3 Health &-Fitness-Tracker with Stress Management, Workout Intensity, Sleep Tracking, 24/7 Heart Rate and More, Midnight Zen/Black One Size (S & L Bands Included)",
    "price": "129.94",
    "main_image_url": "https://m.media-amazon.com/images/I/51CtR+quteL._AC_SY700_SX700_.jpg",
    "page_url": "https://amazon.ca/dp/B0B5F9SZW7",
    "description": [
      "Inspire 3 is the tracker that helps you find your energy, do what you love and feel your best. All you have to do is wear it.Operating temperature: 0° to 40°C",
      "Move more: Daily Readiness Score(1), Active Zone Minutes, all-day activity tracking and 24/7 heart rate, 20+ exercise modes, automatic exercise tracking and reminders to move",
      "Stress less: always-on wellness tracking, daily Stress Management Score, mindfulness sessions, relax breathing sessions, irregular heart rhythm notifications(2), SpO2(3), menstrual health tracking, resting heart rate and high/low heart rate notifications",
      "Sleep better: automatic sleep tracking, personalized Sleep Profile(1), daily detailed Sleep Score, smart wake vibrating alarm, sleep mode",
      "Comfortably connected day and night: calls, texts & smartphone app notifications(4), color touchscreen with customizable clock faces, super lightweight and water resistant to 50 meters, up to 10 day battery life(5)",
      "Includes a 6-month Premium membership complete with personalized insights, advanced analytics and more (New & returning Premium users only. Must activate trial within 60-days of device activation. Content and features may change)"
    ],
    "rating": "4.3",
    "scraped_at": "2025-07-17 22:55:46",
    "review_count": 11758
  },
  {
    "merchandise": "amazon",
    "country": "ca",
    "id": "90f22154-12d0-407c-a386-f3ba15289ac0",
    "asin": "B0D6B1GJHT",
    "title": "RORRY Portable Charger, 10000mAh PD 20W Fast Charging Portable Charger Power Bank with Built in Cables, Travel Battery Pack for iPhone 15/14/13/12/11 and Apple Watch Ultra/9/8/7/6/5/4/3/2, White",
    "price": "53.99",
    "main_image_url": "https://m.media-amazon.com/images/I/61KAd3Q3XpL._AC_SY700_.jpg",
    "page_url": "https://amazon.ca/dp/B0D6B1GJHT",
    "description": [
      "Meets all Your Charging Needs: RORRY portable charger with built in USB-C cable, iOS cable and magnetic wireless charger for iWatch , widely compatible with iPhone 16/15/14/13/12/11/XS/XR/SE Pro/Pro Max, Apple Watch Ultra 2/Ultra/9/8/7/6/SE/5/4/3/2, AirPods and more.",
      "PD 20W Fast Charging Power Bank: RORRY portable charger power bank charge your iPhone 16 Pro to a whopping 56% in just 30 minutes and fully power it up in 1.5 hours! fully charged for Apple Watch series 9 in 1.42 hours. Enjoy a high-speed charging experience on the go!",
      "10000mAh - Power On The Go: This portable charger has a large capacity of 10,000 mAh, yet it’s compact and lightweight, perfect for short trips, it gives you up to 2 full charges for your iPhone 15 Pro or 20 charges for Apple Watch series 9—talk about staying powered up!",
      "Travel Must-Have: Weighing in at about 7.3 ounces (yup, just like the iPhone 14 Pro!), this compact charger (4.33“ x 2.83” x 0.83”) slips easily into your purse. with a handy hanging loop, you can sport it on your finger or backpack—traveling just got a whole lot easier!",
      "Superior Safety Features: The Multi-protection smart microchip can protect your cell phone from short circuit, overheating, overcharging, over voltage or over current, etc. The adventure-grade drop-resistant structure and premium PC hard-shell design feature superior resistance to pressure and scratches. The built-in charging cable has proven its durability, tear and bend resistance with over 10,000 bending tests.UL, FCC and CE certified for added security for your device."
    ],
    "rating": "4.4",
    "scraped_at": "2025-07-17 22:55:59",
    "review_count": 1303
  },
  {
    "merchandise": "amazon",
    "country": "ca",
    "id": "917fbd4d-17bd-4291-b015-22b2e4c7507f",
    "asin": "B07X4WT456",
    "title": "RUNNING GIRL Strappy Sports Bra for Women, Sexy Crisscross Back Medium Support Yoga Bra with Removable Cups",
    "price": "37.99",
    "main_image_url": "https://m.media-amazon.com/images/I/81hnEloWEuL._AC_SY679_.jpg",
    "page_url": "https://amazon.ca/dp/B07X4WT456",
    "description": [],
    "rating": "4.5",
    "scraped_at": "2025-07-17 22:56:10",
    "review_count": 14786
  },
  {
    "merchandise": "amazon",
    "country": "ca",
    "id": "5db32fa6-3391-4886-905c-95485cbbaefd",
    "asin": "B0CTP56C5R",
    "title": "JBL Clip 5 - Ultra-Portable, Waterproof and Dustproof Bluetooth Speaker, Integrated Carabiner, Up to 12 Hours of Play, Made in Part with Recycled Materials (Black)",
    "price": "79.98",
    "main_image_url": "https://m.media-amazon.com/images/I/81BdIR8hyUL.__AC_SX700_SY700_QL70_ML2_.jpg",
    "page_url": "https://amazon.ca/dp/B0CTP56C5R",
    "description": [
      "Ultra-portable JBL Pro Sound: Don't let its little size fool you. The JBL Clip 5 packs a serious musical punch, delivering big JBL Pro Sound with punchy bass. Your friends won't believe how much great JBL Pro Sound comes out of such a small speaker.",
      "Redesigned carabiner: The completely redesigned, fully integrated carabiner has a much wider opening that makes it even more portable. You can attach the Clip 5 to everything from your backpack to your belt loop, and take your music with you all day, everywhere.",
      "Up to 12 hours of playtime plus 3 hours with Playtime Boost: Don't sweat the small stuff—like charging your battery. JBL Clip 5 gives you up to 12 hours of playtime on a single charge. Simply tap Playtime Boost to prolong the playtime, adding up to 3 hours to your battery life. It tunes and optimizes the performance for louder and crisper sound.",
      "Waterproof and dustproof: The JBL Clip 5's IP67 waterproof and dustproof rating ensures this portable speaker can handle almost any environment, from a poolside party to a seaside picnic.",
      "Multi-speaker connection by Auracast: Want even bigger JBL Pro Sound? Pair two Clip 5s for stereo sound, or wirelessly connect multiple JBL Auracast-enabled speakers using Auracast for even bigger sound."
    ],
    "rating": "4.7",
    "scraped_at": "2025-07-17 22:56:22",
    "review_count": 3892
  }
]